&НаСервере
Функция ВыполнитьЗапрос()
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1 КАК ВидДокумента,
	|	Док.Дата КАК Дата,
	|	Док.Ссылка КАК Ссылка,
	|	Док.Организация,
	|	Док.Контрагент,
	|	NULL КАК ДокументОтгрузки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ЕстьДатаНач
	|				ТОГДА Док.Дата >= &ДатаНач
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьДатаКон
	|				ТОГДА Док.Дата <= &ДатаКон
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОрганизация
	|				ТОГДА Док.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2,
	|	Док.Дата,
	|	Док.Ссылка,
	|	Док.Организация,
	|	NULL,
	|	Док.ДокументОтгрузки
	|ИЗ
	|	Документ.РеализацияОтгруженныхТоваров КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА &ЕстьДатаНач
	|				ТОГДА Док.Дата >= &ДатаНач
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьДатаКон
	|				ТОГДА Док.Дата <= &ДатаКон
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ЕстьОрганизация
	|				ТОГДА Док.Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ";	
	
	Запрос.УстановитьПараметр("ЕстьДатаНач", ЗначениеЗаполнено(Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ЕстьДатаКон", ЗначениеЗаполнено(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
	
	Запрос.УстановитьПараметр("ЕстьОрганизация", ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	
	Возврат Запрос.Выполнить();
	
	
КонецФункции

&НаСервере
Процедура ВыполнитьДопроведениеНаСервере()
	
	РезультатЗапроса = ВыполнитьЗапрос();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	
	Пока Выборка.Следующий() Цикл
		
		Отказ = Ложь;
		
		ДЭТК_ОбщийМодуль1.ДЭТК_ПроведениеРеализацииОбработкаПроведения(Выборка.Ссылка.ПолучитьОбъект(), Отказ, РежимПроведения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДопроведение(Команда)
	ВыполнитьДопроведениеНаСервере();
	//Предупреждение("Обработка завершена!");
	
КонецПроцедуры

